import 'package:amina/Models/faq_model.dart';
import 'package:flutter/material.dart';

class FAQViewModel extends ChangeNotifier {
  List<FAQItem> _items = [
    FAQItem(
        question: 'ما هو أبليكيشن أمينة ؟',
        answer:
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."),
    FAQItem(
        question: 'ما هو أبليكيشن أمينة ؟',
        answer:
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."),
    FAQItem(
        question: 'ما هو أبليكيشن أمينة ؟',
        answer:
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."),
    FAQItem(
        question: 'ما هو أبليكيشن أمينة ؟',
        answer:
            "هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى، حيث يمكنك أن تولد مثل هذا النص أو العديد من النصوص الأخرى إضافة إلى زيادة عدد الحروف التى يولدها التطبيق."),
  ];

  List<FAQItem> get items => _items;

  void toggleExpansion(int index) {
    _items[index].isExpanded = !_items[index].isExpanded;
    notifyListeners();
  }
}
